Revit 2024 API
BuiltInFailures.TrussFailures.IncorrectWallUsageWithAttachedStruct Property
 A structural framing element is attached to a wall whose Structural Usage is set to [Usage].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId IncorrectWallUsageWithAttachedStruct { get; }
Visual Basic
Public Shared ReadOnly Property IncorrectWallUsageWithAttachedStruct As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ IncorrectWallUsageWithAttachedStruct {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.TrussFailures Class
Autodesk.Revit.DB Namespace